common/models/Connect.php

  public function __construct()
  {
    $this->token = Token::findOne(1)->token;
---
SELECT * FROM `token` WHERE `id`=1