console/models/GetInfo.php

  public function __construct()
  {
    $this->token = Token::findOne(1)->token_old;
---
SELECT * FROM `token` WHERE `id`=1