frontend/views/layouts/main.php

use yii\bootstrap4\Html;
use yii\helpers\Url;

$user = \common\models\User::findOne(Yii::$app->getUser()->getId());
---
SELECT * FROM `user` WHERE `id` IS NULL