frontend/models/SignupForm.php

    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->is_student = $this->is_student;
        $user->status = 10;
        $user->phone = $this->phone;
        $user->gender = $this->gender ? $this->gender : null;
        $user->status = 10;
        $user->crm_id = $this->crm_id;
        $user->setPassword($this->password);
        $user->generateAuthKey();
        $user->generateEmailVerificationToken();

        return $user->save() && $this->sendEmail($user);
---
INSERT INTO `user` (`username`, `email`, `is_student`, `status`, `phone`, `gender`, `crm_id`, `password_hash`, `auth_key`, `verification_token`, `created_at`, `updated_at`) VALUES ('Александр Тестовый Ученик', 'qwe@qwe.ru', 0, 10, '+7 (949) 451-84-07', NULL, 3166, '$2y$13$LhPdKh4/qZ1MEiYUw/WKNOGBlOFBWs1X1JgUtt3A5L1pq6ngcxAOq', 'Y3QybgTTf0dlnOQUiOwq5viRhgnzHNXv', 'XqnMz-Fh2tjdasuJitQiMDSKvU_syu4t_1658744141', 1658744141, 1658744141)