frontend/views/site/signup.php

use yii\bootstrap4\ActiveForm;
use yii\helpers\Url;

$token = Token::findOne(2)->token;
---
SELECT * FROM `token` WHERE `id`=2